Repository: robot-xliff-farmer/mapsapi-examples
Catalog: mapsapi-examples.tmx
Source language: ru
Languages: en

source: Можно указывать как отдельные элементы управления, так и их набор. Если карту нужно отобразить без элементов управления, то в поле controls передать пустой массив [].
en: You can specify individual controls, or a set of them. If you want to display the map without controls, pass an empty array [] in the "controls" field.

source: Со списком доступных элементов управления можно ознакомиться тут.
en: A list of the available controls can be found here.

source: Для того чтобы маршрут был проложен с учетом пробок, необходимо передать в параметрах маршрутизации поле avoidTrafficJams: true. По умолчанию данное поле принимает значение false.
en: In order for a route to account for traffic, you need to pass the field avoidTrafficJams: true in the routing parameters. By default, this field takes the false value.

source: Пробки могут учитываться при построении маршрута как на автомобиле, так и на общественном транспорте.
en: Traffic can be taken into account when planning a route by car or by public transport.

source: Маршрут на общественном транспорте.
en: The route on public transport.

source: Порядок координат в запросе: долгота, широта.
en: The order of the coordinates in the request: longitude, latitude.

source: true - не изменять значение непереданных параметров.
en: true - do not change the value of omitted options.

source: Устанавливает параметры маршрутизации.
en: Sets the routing parameters.

source: Прокладывать мультимаршрут с учетом информации о текущих пробках на дорогах.
en: Plot a multiroute, taking into account information about the current traffic.

source: Не учитывать пробки.
en: Do not calculate for traffic.

source: Создаем экземпляр класса ymaps.control.SearchControl
en: Creating an instance of the ymaps.control.SearchControl class.

source: В данном примере показано, как задать собственное отображение результатов поиска.
en: This example shows how to set a custom display for search results.

source: Выбранные результаты добавляются в коллекцию [#$dp11], на которой слушается событие "click". При клике по найденному объекту его метка становится красной.
en: The selected results are added to the [#$dp11] collection, which listens for the "click" event. When the found object is clicked, its placemark turns red.

source: Также для объектов коллекции задан собственный макет всплывающей подсказки.
en: Similarly, the custom layout for a popup hint is set for objects in the collection.

source: Ссылка на редактор маршрута находится в поле editor экземпляра класса [#$dp7].
en: The reference to the route editor is in the editor field of the [#$dp7] class instance.

source: Для включения/выключения режима редактирования мультимаршрута используются функции start() и stop() соответственно.
en: To turn the multiroute edit mode on/off, use the functions start() and stop (), respectively.

source: При включении режима редактирования функции start() могут быть переданы параметры редактирования. Список допустимых параметров приведен в комментариях в коде.
en: When you turn on the edit mode, the start() function may be passed the editing parameters. For a list of valid parameters, see the comments in the code.

source: Обратите внимание, что параметры midPointsType (тип промежуточных точек, которые могут быть добавлены при редактировании) и drawOver (запрет на добавление точек поверх объектов карты) передаются в параметрах маршрутизатора с префиксом editor.
en: Note that the parameters midPointsType (a type of intermediate points that can be added when editing) and drawOver (forbidding adding points on top of map objects) are passed in the router parameters with the "editor" prefix.

source: Включение режима редактирования. В качестве опций может быть передан объет с полями: addWayPoints - разрешает добавление новых путевых точек при клике на карту. Значение по умолчанию: false. dragWayPoints - разрешает перетаскивание уже существующих путевых точек. Значение по умолчанию: true. removeWayPoints - разрешает удаление путевых точек при двойном клике по ним. Значение по умолчанию: false. dragViaPoints - разрешает перетаскивание уже существующих транзитных точек. Значение по умолчанию: true. removeViaPoints - разрешает удаление транзитных точек при двойном клике по ним. Значение по умолчанию: true. addMidPoints - разрешает добавление промежуточных транзитных или путевых точек посредством перетаскивания маркера, появляющегося при наведении курсора мыши на активный маршрут. Тип добавляемых точек задается опцией midPointsType. Значение по умолчанию: true
en: Turning on edit mode. For options, you can pass an object with fields: addWayPoints - allows adding new waypoints by clicking on the map. Default value: false. dragWayPoints - allows dragging existing waypoints. Default value: true. removeWayPoints - allows deleting waypoints by double clicking on them. Default value: false. dragViaPoints - allows dragging existing through points. Default value: true. removeViaPoints - allows deleting through points by double-clicking on them. Default value: true. addMidPoints - allows adding intermediate through points or waypoints by dragging the marker that appears when you hover the mouse cursor over the active route. The type of added points is set in the midPointsType option. Default value: true

source: На карту можно добавлять слой с информацией о пробках. При этом необязательно размещать на карте элемент управления "Пробки". Достаточно добавить на карту соответствующий провайдер данных о пробках. В данном примере используется провайдер пробок "Сейчас" [#$dp6].
en: You can add a layer to the map with information about traffic. However, it is not necessary to put the "Traffic" control on the map. It is enough to add the appropriate traffic data provider to the map. This example uses the "Now" traffic provider [#$dp6].

source: Макеты объектов можно создавать с помощью фабрики [#$dp5], используя текcтовые шаблоны.
en: Object layouts can be created using the [#$dp5] factory, and using text templates.

source: В данном примере создается пользовательский макет балуна мультимаршрутизатора, в котором отображается информация о выбранном маршруте: для какого вида транспорта проложен маршрут, длина маршрута и время в пути. Макет балуна задается через опции мультимаршрутизатора.
en: This example creates a custom layout for the multirouter balloon, which displays information about the selected route: for each type of transport, it shows the route, route length and travel time. The layout of the balloon is specified via the multirouter options.

source: В данном примере создается пользовательский макет кнопки. Макет элемента управления строится на основе его данных, состояния и опций.
en: This example creates a custom layout for a button. The layout of the control is based on its data, status, and options.

source: Для построения маршрута предназначена функция [#$dp8]. В эту функцию передается массив точек, через которые нужно проложить маршрут и, при необходимости, дополнительные опции его построения.
en: To build a route, use the [#$dp8] function. This function is passed an array of points that the route must pass through and, if necessary, additional options for building the route.

source: Вычисление маршрута производится асинхронно (то есть во время выполнения функции route производится обмен данными с сервером). Результат передается в функцию-обработчик в виде коллекции [#$dp11], которую можно разместить на карте.
en: The route calculation is performed asynchronously (that is, during the execution of the "route" function, data is exchanged with the server). The result is passed to the handler function as a [#$dp11] collection, which can be placed on the map.

source: В данном примере создается класс, принимающий мультимаршрут общественного транспорта и выполняющий раскраску его сегментов в зависимости от их типа. Пример иллюстрирует работу с событиями и данными маршрута и его составных частей.
en: This example creates a class that accepts a public transport multiroute and color codes the route segments according to type. The example shows how to work with events and data for a route and its parts.

source: Примеры. Работа с данными и событиями мультимаршрута
en: Examples. Working with multiroute data and events

source: Класс, раскрашивающий сегменты маршрута в различные цвета в зависимости от типа сегмента и типа транспорта.
en: A class that color codes route segments in various colors depending on the type of segment and type of transport.

source: Подписываемся на события обновления мультимаршрута и смены активного маршрута.
en: Subscribing to the multiroute update event and changing the active route.

source: Берем текущий активный маршрут и раскрашиваем его.
en: Taking the current active route and coloring it.

source: Пресет внешнего вида для сегментов электричек.
en: Preset appearance for train segments.

source: Пресет внешнего вида для сегментов автобусов, троллейбусов и трамваев.
en: Preset appearance for bus, trolley, and tram segents.

source: Пресет внешнего вида для пеших сегментов.
en: Preset appearance for walking segments.

source: Обработчик смены активного маршрута.
en: Handler for changing the active route.

source: Снимаем раскраску с предыдущего активного маршрута, иначе он останется раскрашенным в неактивном состоянии.
en: Removing the color from the previous active route. Otherwise, it will stay colored in the inactive state.

source: Запоминаем новый активный маршрут и раскрашиваем его.
en: Storing the new active route and coloring it.

source: Применяем к карте границы активного маршрута.
en: Applying the borders of the active route to the map.

source: При обновлении маршрута выполняем раскрашивание заново.
en: When updating the route, color coding is repeated.

source: Если есть активный маршрут, перебираем все пути маршрута. Для каждого пути перебираем все сегменты и устанавливаем каждому из них параметры внешнего вида в зависимости от типа сегмента.
en: Searching through all the paths of the active route, if there is an active route. For each path, it goes through all the segments and sets the appearance parameters for each of them according to the type of segment.

source: Сюда попадут сегменты с типами "walk" (пешеходный) и "transfer" (переход между станциями).
en: This includes segments with the types "walk" (walking) and "transfer" (transfer between stations).

source: Перебираем все сегменты и для каждого из них удаляем настройки внешнего вида.
en: Searching through all the segments and deleting the appearance settings for each of them.

source: Метод, раскрашивающий транспортные сегменты.
en: Method that color codes transport segments.

source: Берем первую запись о транспорте из массива транспортных средств сегмента и на ее основе раскрашиваем сегмент. Как правило для одного сегмента тип возможных транспортных средств не отличается радикально. Т.е. не бывает сегментов, по которым можно проехать как на метро, так и на автобусе. Различие же между автобусом и маршрутным такси в нашем случае неважно.
en: Taking the first record about transport from the segment's array of transport and color coding the segment based on this record. For a single segment, the possible methods of transportation do not normally have radically different types. In other words, there aren't any segments that you can travel on both the subway and the bus. In our case, the difference between a bus and a taxi minibus is not important.

source: Цвет линии метро берем из данных сегмента.
en: Taking the color of the subway line from the segment data.

source: Создаем мультимаршрут.
en: Creating a multiroute.

source: Создаем объект, раскрашивающий линии сегментов маршрута.
en: Creating an object that color codes the lines of route segments.

source: Создание макета содержимого балуна. Макет создается с помощью фабрики макетов с помощью текстового шаблона.
en: Creating a balloon content layout. The layout is created using the layout factory and a text template.

source: Переопределяем функцию build, чтобы при создании макета начинать слушать событие click на кнопке-счетчике.
en: Redefining the "build" function in order to start listening to the "click" event on a counter button when creating the layout.

source: Сначала вызываем метод build родительского класса.
en: First, we call the "build" method of the parent class.

source: А затем выполняем дополнительные действия.
en: Then we perform additional steps.

source: Аналогично переопределяем функцию clear, чтобы снять прослушивание клика при удалении макета с карты.
en: In the same way, we redefine the "clear" function in order to remove listening for clicks when the layout is deleted from the map.

source: Выполняем действия в обратном порядке - сначала снимаем слушателя, а потом вызываем метод clear родительского класса.
en: We perform the steps in reverse order - first remove the listener, and then call the "clear" method of the parent class.

source: Запретим замену обычного балуна на балун-панель. Если не указывать эту опцию, на картах маленького размера откроется балун-панель.
en: Disabling replacing the normal balloon with the balloon panel. If you do not specify this option, the balloon panel opens on small maps.

source: Примеры. Макет балуна геообъекта.
en: Examples. The layout of a geo object's balloon.

source: API предоставляет возможность создавать собственные карты.
en: The API allows you to create your own custom maps.

source: Создаем проекцию для декартовой системы координат.
en: Creating a projection for the Cartesian coordinate system.

source: Определяем границы области отображения в декартовых координатах.
en: Defining the boundaries of the display area in Cartesian coordinates.

source: Создадим собственный слой карты:
en: Creating a custom map layer:

source: Зададим функцию, преобразующую номер тайла и уровень масштабировая в URL тайла на сервере.
en: Defining the function that converts the tile number and zoom level to the URL of the tile on the server.

source: Добавим конструктор слоя в хранилище слоёв под ключом my#layer.
en: Adding a layer constructor to the layer storage with the key my#layer.

source: Создадим новый тип карты, состоящий только из нашего слоя тайлов, и добавим его в хранилище типов карты под ключом my#type.
en: Creating a new map type consisting only of our tile layer, and adding it to the storage for map types with the key my#type.

source: Создадим карту в заданной системе координат.
en: Creating a map in the specified coordinate system.

source: Выставим опцию, чтобы зум-контрол был минимального размера независимо от размеров карты.
en: Setting an option so the zoom control is minimal size regardless of the size of the map.

source: Примеры. Создание собственной карты
en: Examples. Creating your own map

source: Список стран
en: List of countries

source: Доступные языки
en: Available languages

source: Раскраска по странам
en: Color-coding by country

source: Примеры. Регионы
en: Examples. Regions

source: Отображаются все доступные страны. Вы можете уточнить язык или уровень детализации соответственно.
en: All available countries are displayed. You can specify the language or detail level accordingly.

source: Язык: Уровень детализации:
en: Language: Detail level:

source: 0(минимальный)
en: 0(minimal)

source: 3(максимальный)
en: 3(maximum)

source: Прямоугольник может быть создан двумя способами: с помощью класса GeoObject с указанием типа геометрии "Прямоугольник" либо с помощью вспомогательного класса Rectangle.
en: A rectangle can be created in two ways: using the GeoObject class indicating the "Rectangle" geometry type, or using an auxiliary Rectangle class.

source: При создании прямоугольника необходимо указать координаты двух его противоположных вершин. Также для него могут быть заданы свойства (например, содержимое его балуна или хинта) и опции (например, цвет его заливки).
en: When creating a rectangle, you must specify the coordinates of two opposite vertices. You may also specify its properties (for example, the contents of its balloon or hint) and options (such as fill color).

source: Прямоугольники могут объединяться в коллекции.
en: Rectangles can be combined in a collection.

source: Cоздаем геообъект с типом геометрии "прямоугольник".
en: Creating a geo object with the "rectangle" geometry type.

source: Геометрия = тип геометрии + координаты геообъекта.
en: Geometry = geometry type + the coordinates of the geo object.

source: Тип геометрии - прямоугольник.
en: The geometry type is rectangle.

source: Координаты.
en: The coordinates.

source: Опции. Объект можно перетаскивать.
en: Options. The object can be dragged.

source: Цвет и прозрачность заливки.
en: The fill color and transparency.

source: Цвет и прозрачность границ.
en: The color and transparency of borders.

source: Создаем прямоугольник с помощью вспомогательного класса.
en: Creating a rectangle using an auxiliary class.

source: Задаем координаты диагональных углов прямоугольника.
en: Setting the coordinates of the diagonal corners of the rectangle.

source: Опции. Цвет и прозрачность заливки.
en: Options. The fill color and transparency.

source: Дополнительная прозрачность заливки.. Итоговая прозрачность будет не #33(0.2), а 0.1(0.2*0.5).
en: Additional fill transparency. The resulting transparency will not be #33(0.2), but 0.1(0.2*0.5).

source: Радиус скругления углов. Данная опция принимается только прямоугольником.
en: The radius of rounded corners. This option is accepted only for a rectangle.

source: Примеры. Прямоугольник
en: Examples. Rectangle

source: Пример демонструрет создание собственного элемента управления и его размещение на карте.
en: The example demonstrates creating your own control and putting it on the map.

source: Встречаются ситуации, когда задачи по работе с картой невозможно решить с помощью стандартных элементов управления. В этом случае нужно реализовать свой элемент управления и настроить его отображение.
en: Sometimes, certain tasks with the map cannot be performed using the standard controls. In this case, you need to implement a custom control and customize its appearance.

source: Элемент управления должен реализовывать интерфейс [#$dp12]. Данный пример показывает, как создать собственный элемент управления и добавить его на карту.
en: The control must implement the [#$dp12] interface. This example shows how to create a custom control and add it to the map.

source: Создадим экземпляр нашего элемента управления.
en: Creating an instance of our control.

source: Добавим его в менеджер элементов управления.
en: Adding it to the controls manager.

source: Макет элемента управления.
en: Control layout.

source: Добавляем обработчик клика по элементу управления.
en: Adding a handler for clicks on the control.

source: Например, выведем текущее описание элемента управления.
en: For example, displaying the current description of the control.

source: Свой элемент управления.
en: Custom control.

source: @param {Object} [parameters] Параметры элемента управления.
en: @param {Object} [parameters] Control parameters.

source: @param {Object} [parameters.options] Опции элемента управления.
en: @param {Object} [parameters.options] Control options.

source: @param {Boolean} [parameters.options.visible = true] Показывать ли элемент управления на карте.
en: @param {Boolean} [parameters.options.visible = true] Whether to show the control on the map.

source: @param {String} [parameters.options.float = 'right'] Положение элемента управления. Может принимать значения "none", "left" и "right".
en: @param {String} [parameters.options.float = 'right'] Position of the control. Can take the values "none", "left" and "right".

source: @param {Number|Number[]} [parameters.options.maxWidth = 90] Максимальная ширина элемента управления.
en: @param {Number|Number[]} [parameters.options.maxWidth = 90] Maximum width of the control.

source: @param {Object} [parameters.options.position] Позиция элемента управления. При указании опции position значение опции float автоматически трактуется как "none".
en: @param {Object} [parameters.options.position] Position of the control. When the "position" option is set to the value "float", it is automatically interpreted as "none".

source: @param {String} [parameters.options.size = 'auto'] Параметр, отвечающий за внешний вид макета элемента управления. Может принимать значения:
en: @param {String} [parameters.options.size = 'auto'] Parameter responsible for the appearance of the control's layout. Can take the values:

source: 'auto' - стандартный макет кнопки автоматически изменяет свой внешний вид в зависимости от размеров карты и от количества добавленных элементов управления;
en: 'auto' - the default button layout automatically changes its appearance depending on the size of the map and the number of added controls.

source: 'small' - в макете кнопки отображается иконка, независимо от размера карты;
en: 'small' - the icon will be displayed in the button layout, regardless of the size of the map.

source: 'medium' - в макете кнопки отображается только текст, независимо от размера карты;
en: 'medium' - only the text is displayed in the button layout, regardless of the size of the map.

source: 'large' - в макете кнопки всегда отображается иконка и текст, независимо от размера карты.
en: 'large' - the icon and the text are always displayed in the button layout, regardless of map size.

source: @param {Number} [parameters.options.position.top] Позиция относительно верхнего края.
en: @param {Number} [parameters.options.position.top] Position relative to the top edge.

source: @param {Number} [parameters.options.position.bottom] Позиция относительно нижнего края.
en: @param {Number} [parameters.options.position.bottom] Position relative to the bottom edge.

source: @param {Number} [parameters.options.position.left] Позиция относительно левого края.
en: @param {Number} [parameters.options.position.left] Position relative to the left edge.

source: @param {Number} [parameters.options.position.right] Позиция относительно правого края.
en: @param {Number} [parameters.options.position.right] Position relative to the right edge.

source: @param {Object} [parameters.state] Состояние элемента управления.
en: @param {Object} [parameters.state] State of the control.

source: @param {Object} [parameters.data] Данные элемента управления.
en: @param {Object} [parameters.data] Data for the control.

source: @param {String} [parameters.data.content = "my text"] Содержание, которое будет отображаться.
en: @param {String} [parameters.data.content = "my text"] Content that will be displayed.

source: @param {String} [parameters.data.title = "my title"] Подсказка при наведении на элемент управления.
en: @param {String} [parameters.data.title = "my title"] Tooltip when you hover over the control.

source: Менеджер событий.
en: Event manager.

source: Менеджер опций.
en: Options manager.

source: Менеджер данных.
en: Data manager.

source: Менеджер состояний.
en: State manager.

source: Создаем макет элемента управления.
en: Creating the layout of the control.

source: Устанавливает родительский объект.
en: Sets the parent object.

source: @param {IControlParent} parent Родительский объект.
en: @param {IControlParent} parent The parent object.

source: @returns {CustomControl} Возвращает ссылку на себя.
en: @returns {CustomControl} Returns a reference to itself.

source: Так как операция выполняется асинхронно, прежде чем выставить макету родительский элемент, необходимо проверить, не изменился ли callback, то есть что это один и тот же запрос.
en: Since the operation is performed asynchronously, before setting the layout of the parent element, you must verify that the callback has not changed (that it is the same request).
